// Thanks to http://qaz.wtf/u/convert.cgi and https://fancytextguru.com
var vigS = (x, y) => x.split(y ? '' : ' '),
vigSL = 'abcdefghijklmnopqrstuvwxyz',
vigBigArr = vigS(vigSL.toUpperCase(), 1).concat(
  vigS(vigSL, 1),
  vigS('ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ', 1),
  vigS('ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ', 1),
  vigS('🅐 🅑 🅒 🅓 🅔 🅕 🅖 🅗 🅘 🅙 🅚 🅛 🅜 🅝 🅞 🅟 🅠 🅡 🅢 🅣 🅤 🅥 🅦 🅧 🅨 🅩'),
  vigS('ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ', 1),
  vigS('ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ', 1),
  vigS('𝐀 𝐁 𝐂 𝐃 𝐄 𝐅 𝐆 𝐇 𝐈 𝐉 𝐊 𝐋 𝐌 𝐍 𝐎 𝐏 𝐐 𝐑 𝐒 𝐓 𝐔 𝐕 𝐖 𝐗 𝐘 𝐙'),
  vigS('𝐚 𝐛 𝐜 𝐝 𝐞 𝐟 𝐠 𝐡 𝐢 𝐣 𝐤 𝐥 𝐦 𝐧 𝐨 𝐩 𝐪 𝐫 𝐬 𝐭 𝐮 𝐯 𝐰 𝐱 𝐲 𝐳'),
  vigS('𝕬 𝕭 𝕮 𝕯 𝕰 𝕱 𝕲 𝕳 𝕴 𝕵 𝕶 𝕷 𝕸 𝕹 𝕺 𝕻 𝕼 𝕽 𝕾 𝕿 𝖀 𝖁 𝖂 𝖃 𝖄 𝖅'),
  vigS('𝖆 𝖇 𝖈 𝖉 𝖊 𝖋 𝖌 𝖍 𝖎 𝖏 𝖐 𝖑 𝖒 𝖓 𝖔 𝖕 𝖖 𝖗 𝖘 𝖙 𝖚 𝖛 𝖜 𝖝 𝖞 𝖟'),
  vigS('𝑨 𝑩 𝑪 𝑫 𝑬 𝑭 𝑮 𝑯 𝑰 𝑱 𝑲 𝑳 𝑴 𝑵 𝑶 𝑷 𝑸 𝑹 𝑺 𝑻 𝑼 𝑽 𝑾 𝑿 𝒀 𝒁'),
  vigS('𝒂 𝒃 𝒄 𝒅 𝒆 𝒇 𝒈 𝒉 𝒊 𝒋 𝒌 𝒍 𝒎 𝒏 𝒐 𝒑 𝒒 𝒓 𝒔 𝒕 𝒖 𝒗 𝒘 𝒙 𝒚 𝒛'),
  vigS('𝓐 𝓑 𝓒 𝓓 𝓔 𝓕 𝓖 𝓗 𝓘 𝓙 𝓚 𝓛 𝓜 𝓝 𝓞 𝓟 𝓠 𝓡 𝓢 𝓣 𝓤 𝓥 𝓦 𝓧 𝓨 𝓩'),
  vigS('𝓪 𝓫 𝓬 𝓭 𝓮 𝓯 𝓰 𝓱 𝓲 𝓳 𝓴 𝓵 𝓶 𝓷 𝓸 𝓹 𝓺 𝓻 𝓼 𝓽 𝓾 𝓿 𝔀 𝔁 𝔂 𝔃'),
  vigS('𝔸 𝔹 ℂ 𝔻 𝔼 𝔽 𝔾 ℍ 𝕀 𝕁 𝕂 𝕃 𝕄 ℕ 𝕆 ℙ ℚ ℝ 𝕊 𝕋 𝕌 𝕍 𝕎 𝕏 𝕐 ℤ'),
  vigS('𝕒 𝕓 𝕔 𝕕 𝕖 𝕗 𝕘 𝕙 𝕚 𝕛 𝕜 𝕝 𝕞 𝕟 𝕠 𝕡 𝕢 𝕣 𝕤 𝕥 𝕦 𝕧 𝕨 𝕩 𝕪 𝕫'),
  vigS('𝙰 𝙱 𝙲 𝙳 𝙴 𝙵 𝙶 𝙷 𝙸 𝙹 𝙺 𝙻 𝙼 𝙽 𝙾 𝙿 𝚀 𝚁 𝚂 𝚃 𝚄 𝚅 𝚆 𝚇 𝚈 𝚉'),
  vigS('𝚊 𝚋 𝚌 𝚍 𝚎 𝚏 𝚐 𝚑 𝚒 𝚓 𝚔 𝚕 𝚖 𝚗 𝚘 𝚙 𝚚 𝚛 𝚜 𝚝 𝚞 𝚟 𝚠 𝚡 𝚢 𝚣'),
  vigS('𝖠 𝖡 𝖢 𝖣 𝖤 𝖥 𝖦 𝖧 𝖨 𝖩 𝖪 𝖫 𝖬 𝖭 𝖮 𝖯 𝖰 𝖱 𝖲 𝖳 𝖴 𝖵 𝖶 𝖷 𝖸 𝖹'),
  vigS('𝖺 𝖻 𝖼 𝖽 𝖾 𝖿 𝗀 𝗁 𝗂 𝗃 𝗄 𝗅 𝗆 𝗇 𝗈 𝗉 𝗊 𝗋 𝗌 𝗍 𝗎 𝗏 𝗐 𝗑 𝗒 𝗓'),
  vigS('𝗔 𝗕 𝗖 𝗗 𝗘 𝗙 𝗚 𝗛 𝗜 𝗝 𝗞 𝗟 𝗠 𝗡 𝗢 𝗣 𝗤 𝗥 𝗦 𝗧 𝗨 𝗩 𝗪 𝗫 𝗬 𝗭'),
  vigS('𝗮 𝗯 𝗰 𝗱 𝗲 𝗳 𝗴 𝗵 𝗶 𝗷 𝗸 𝗹 𝗺 𝗻 𝗼 𝗽 𝗾 𝗿 𝘀 𝘁 𝘂 𝘃 𝘄 𝘅 𝘆 𝘇'),
  vigS('𝘼 𝘽 𝘾 𝘿 𝙀 𝙁 𝙂 𝙃 𝙄 𝙅 𝙆 𝙇 𝙈 𝙉 𝙊 𝙋 𝙌 𝙍 𝙎 𝙏 𝙐 𝙑 𝙒 𝙓 𝙔 𝙕'),
  vigS('𝙖 𝙗 𝙘 𝙙 𝙚 𝙛 𝙜 𝙝 𝙞 𝙟 𝙠 𝙡 𝙢 𝙣 𝙤 𝙥 𝙦 𝙧 𝙨 𝙩 𝙪 𝙫 𝙬 𝙭 𝙮 𝙯'),
  vigS('𝘈 𝘉 𝘊 𝘋 𝘌 𝘍 𝘎 𝘏 𝘐 𝘑 𝘒 𝘓 𝘔 𝘕 𝘖 𝘗 𝘘 𝘙 𝘚 𝘛 𝘜 𝘝 𝘞 𝘟 𝘠 𝘡'),
  vigS('𝘢 𝘣 𝘤 𝘥 𝘦 𝘧 𝘨 𝘩 𝘪 𝘫 𝘬 𝘭 𝘮 𝘯 𝘰 𝘱 𝘲 𝘳 𝘴 𝘵 𝘶 𝘷 𝘸 𝘹 𝘺 𝘻'),
  vigS('⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵', 1),
  vigS('🇦 🇧 🇨 🇩 🇪 🇫 🇬 🇭 🇮 🇯 🇰 🇱 🇲 🇳 🇴 🇵 🇶 🇷 🇸 🇹 🇺 🇻 🇼 🇽 🇾 🇿'),
  vigS('🄰 🄱 🄲 🄳 🄴 🄵 🄶 🄷 🄸 🄹 🄺 🄻 🄼 🄽 🄾 🄿 🅀 🅁 🅂 🅃 🅄 🅅 🅆 🅇 🅈 🅉'),
  vigS('🅰 🅱 🅲 🅳 🅴 🅵 🅶 🅷 🅸 🅹 🅺 🅻 🅼 🅽 🅾 🅿 🆀 🆁 🆂 🆃 🆄 🆅 🆆 🆇 🆈 🆉'),
  vigS('𝔄 𝔅 ℭ 𝔇 𝔈 𝔉 𝔊 ℌ ℑ 𝔍 𝔎 𝔏 𝔐 𝔑 𝔒 𝔓 𝔔 ℜ 𝔖 𝔗 𝔘 𝔙 𝔚 𝔛 𝔜 ℨ'),
  vigS('𝔞 𝔟 𝔠 𝔡 𝔢 𝔣 𝔤 𝔥 𝔦 𝔧 𝔨 𝔩 𝔪 𝔫 𝔬 𝔭 𝔮 𝔯 𝔰 𝔱 𝔲 𝔳 𝔴 𝔵 𝔶 𝔷'),
  vigS('𝒜 𝐵 𝒞 𝒟 𝐸 𝐹 𝒢 𝐻 𝐼 𝒥 𝒦 𝐿 𝑀 𝒩 𝒪 𝒫 𝒬 𝑅 𝒮 𝒯 𝒰 𝒱 𝒲 𝒳 𝒴 𝒵'),
  vigS('𝒶 𝒷 𝒸 𝒹 𝑒 𝒻 𝑔 𝒽 𝒾 𝒿 𝓀 𝓁 𝓂 𝓃 𝑜 𝓅 𝓆 𝓇 𝓈 𝓉 𝓊 𝓋 𝓌 𝓍 𝓎 𝓏'),
  vigS('✌ 👌 👍 👎 ☜ ☞ ☝ ☟ ✋ ☺ 😐 ☹ 💣 ☠ ⚐ 🏱 ✈ ☼ 💧 ❄ 🕆 ✞ 🕈 ✠ ✡ ☪'),
  vigS('♋ ♌ ♍ ♎ ♏ ♐ ♑ ♒ ♓ 🙰 🙵 ● ❍ ■ □ ◻ ❑ ❒ ⬧ ⧫ ◆ ❖ ⬥ ⌧ ⍓ ⌘'),
  vigS('ÀÇĊḌȄȨĜǦḢÍĴḲŃṄÔƠỌŖȐṚŢÛṲŴẄẐ', 1),
  vigS('àçĉḋěȅȩḟǧíĭịḱŀṃôơŕȑṙšṱûűẃẏ', 1),
  vigS('ÁČḐÈȆĞḤÎĶǨḶŅṆÕȮŘȒṠŤÜƯṴỤẆŶẒ', 1),
  vigS('áċḍèȇĝḣîĵǩḳńṅõȯọŗȓṛţüưṳŵẅẑ', 1),
  vigS('ÂǍḀẠĎḒÉĠǴḦÏȈĹḼŇṊÖŚṢŨȔṶẈÝŸỲ', 1),
  vigS('âǎčḑéğǵḥïȉķɫḷņṇöřṡťȕṵụẇýŷẓ', 1),
  vigS('ÃĂḂÊĔḘẸĢḨǏȊĻḾÑǸØŎṔŜṪŬȖṾẊỴŹ', 1),
  vigS('ãḁạďḓêġḧǐȋĺḽñňǹṋøśṣũȗṷẉÿỳź', 1),
  vigS('ÄȀḄĆËĖḚẼĤȞḪĽṀÒŐǑȌṖŞṬÙŮẀẌỸŻ', 1),
  vigS('äăȁḃëĕḙẹģȟḩļḿòŏǒȍṕŝṫùŭṿẋỵż', 1),
  vigS('ÅȂȦĈḊĚḞÌĬỊḰĿⱢṂÓȎŔṘŠṰÚŰǓẂẎŽ', 1),
  vigS('åȃȧḅćėḛẽĥḫìľṁóőȏṗşṭúůǔẁẍỹž', 1),
  vigS('$ Þ Ħ Ō Ƃ Ə Ɲ Ʋ Ȣ Ɉ ʀ ʟ ᴅ ᴛ ẞ Ẳ Ễ Ờ ₣ ₭ ₵ ₿ Ↄ Ɽ ꜰ ꟼ'),
  vigS('& þ ī ū ƛ ǰ ȹ ɒ ɜ ɦ ɰ ɺ ʇ ʐ ʤ ʮ ˣ л ᵺ ᶄ ᶌ ẫ ể ỡ ⱱ ꝁ'),
  vigS('£ Ā Ĩ Œ Ɔ Ɛ Ɵ Ƶ Ⱥ Ɍ ʁ я ᴇ ᴜ Ả Ặ Ệ Ỡ ₦ ₮ ₸ ℃ ∅ Ⱨ ꜱ ꭥ'),
  vigS('§ ā į ų ƣ ȝ ȼ ɔ ɝ ɧ ɱ ɻ ʈ ʑ ʥ ʯ β н ᵽ ᶅ ᶍ ậ ễ ủ ꜩ ꝏ'),
  vigS('¥ Ą Ī Ŧ Ƈ Ɠ Ƣ Ʒ Ȼ Ɏ ʏ Ӿ ᴊ ᴠ Ẩ Ẻ Ỉ Ủ ₧ ₱ ₹ ℄ ♇ Ⱬ Ꝁ 🜇'),
  vigS('ª ą ı ſ ƥ ȡ ɇ ɕ ɞ ɨ ɲ ɽ ʉ ʒ ʦ ʰ ρ ᴂ ᵾ ᶆ ᶎ ắ ệ ữ ꜳ ꝗ'),
  vigS('¶ Đ Į Ū Ɗ Ɣ Ʃ Ǥ Ƀ ɢ ʗ ฿ ᴋ ᴡ Ẫ Ế Ỏ Ữ ₨ ₲ ₺ ℉ ❡ ⱻ Ꝗ 🜈'),
  vigS('µ đ ł ƀ ƫ ȣ ɉ ɖ ɟ ɩ ɳ ɾ ʊ ʚ ʧ ʲ χ ᴔ ᵿ ᶇ ᶑ ẳ ỉ ỷ ꜵ ꞎ'),
  vigS('Æ Ē Ł Ų Ƌ Ɨ Ʈ Ƿ Ʉ ɪ ʙ ᴀ ᴍ ᴢ Ậ Ề Ỗ Ỷ ₩ ₳ ₼ ⅃ Ⱡ ⸿ Ꞑ 🝫'),
  vigS('º ē ŋ ƈ ƭ ȴ ɍ ɘ ɡ ɬ ɵ ɿ ʋ ʝ ʨ ʷ ω ᵊ ᶀ ᶈ ᶿ ặ ỏ ỻ ꜷ ꞑ'),
  vigS('Ð Ę Ŋ Ɓ Ǝ Ɯ Ʊ Ȝ Ɇ ɴ ʜ ᴄ ᴏ ᴩ Ắ Ể Ớ ₡ € ₴ ₽ ⅊ Ᵽ Ꙅ ꟻ 🝬'),
  vigS('ß ę ō ƍ ƶ ȵ ɏ ə ɣ ɭ ɶ ʂ ʌ ʞ ʩ ˠ д ᵑ ᶁ ᶉ ẛ ẻ ỗ ⁿ ꜹ ꭡ'),
  vigS('æ ħ œ ƒ ƿ ȶ ɐ ɚ ɤ ɮ ɷ ʃ ʍ ʠ ʪ ˡ е ᵗ ᶂ ᶊ ả ế ớ ₥ ꜻ ꭣ'),
  vigS('ð ĩ ŧ ƙ ǥ ȸ ɑ ɛ ɥ ɯ ɸ ʅ ʎ ʣ ʫ ˢ и ᵫ ᶃ ᶋ ẩ ề ờ ₫ ꜽ 🝛')),
vigStr, vigKey, vigKeyI, vigOrdLoCh = ch => ch.charCodeAt()-97,
vigfilt = x => {
  var y = x.match(/[a-z]/gi);
  if (y === null) return false;
  else {
    vigk.value = x.replace(/[^a-z]/gi, '');
    return y.join``.toLowerCase();
  }
}, vigcrp = decBool => {
  vigKeyI = 0;
  vigStr = vigtext.value;
  vigKey = vigfilt(vigk.value);
  if (!vigKey) {
    vigwrn.innerHTML = 'Key must contain at least one letter';
    return;
  } else vigwrn.innerHTML = '';
  if (decBool)
    vigKey = vigKey.split``.map(e => vigSL[(26-vigOrdLoCh(e))%26]);
  vigtext.value = vigStr.replace(/[\ud800-\udfff]{2}|[^\ud800-\udfff]/g,
    e => {
      var idx = vigBigArr.indexOf(e);
      if (~idx) {
        var res = vigBigArr[
          (idx/26|0)*26+(idx%26+vigOrdLoCh(vigKey[vigKeyI++%vigKey.length]))%26
        ];
        return res;
      } else return e;
    }
  );
};
vigenc.onclick = () => { vigcrp(); };
vigdec.onclick = () => { vigcrp(1); };